# Import libraries

In [5]:
import pandas as pd
import numpy as np
import os

# Import data

In [7]:
path=r'/Users/yasersouri/Desktop/data analysis/Instacart Basket Analysis/02 Data'

In [8]:
df=pd.read_csv(os.path.join(path,'Original Data','customers.csv'),index_col=False)

In [9]:
df_2=pd.read_pickle(os.path.join(path,'Prepared Data','new_df.pkl'))

# Wrangle data

In [11]:
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [12]:
df.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [14]:
df.shape

(206209, 10)

In [15]:
# rename the columns using only small letters
df.rename(columns={'First Name':'first_name'},inplace=True)
df.rename(columns={'Surnam':'surname'},inplace=True)
df.rename(columns={'Gender':'gender'},inplace=True)
df.rename(columns={'STATE':'state'},inplace=True)
df.rename(columns={'Age':'age'},inplace=True)
df.rename(columns={'fam_status':'family_status'},inplace=True)

no need to drop any columns , they are all relevant to the data analysis

# Consistency checks

In [18]:
# check mixed-type data
df.dtypes

user_id           int64
first_name       object
surname          object
gender           object
state            object
age               int64
date_joined      object
n_dependants      int64
family_status    object
income            int64
dtype: object

In [19]:
for col in df.columns.tolist():
  weird = (df[[col]].map(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

first_name

In [20]:
# change data type
df['first_name']=df['first_name'].astype('str')
df['user_id']=df['user_id'].astype('str')

In [21]:
df.dtypes

user_id          object
first_name       object
surname          object
gender           object
state            object
age               int64
date_joined      object
n_dependants      int64
family_status    object
income            int64
dtype: object

In [22]:
#check for missing values
df.isnull().sum()

user_id          0
first_name       0
surname          0
gender           0
state            0
age              0
date_joined      0
n_dependants     0
family_status    0
income           0
dtype: int64

no missing value

In [24]:
# check for duplicates
df_dups = df[df.duplicated()]

In [25]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, family_status, income]
Index: []

no duplicates

# Combine dataframes

In [28]:
df.shape

(206209, 10)

In [29]:
df_2.shape

(32404859, 24)

In [30]:
df_2['user_id'].dtype

dtype('int64')

In [31]:
#change user_id data type into 'str'
df_2['user_id']=df_2['user_id'].astype('str')

In [32]:
#combine the dataframes
new_df=df_2.merge(df, on = 'user_id')

In [57]:
new_df.head()

,order_id,user_id,user_order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,frequency_flag,first_name,surname,gender,state,age,date_joined,n_dependants,family_status,income
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,Frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,Frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,Frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,Frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

# Export dataframe

In [63]:
new_df.to_pickle(os.path.join(path,'Prepared Data','df.pkl'))